In [1]:
import pandas as pd
import sqlite3

DB_PATH = r"..\data\metro.db"
TABLE = "Metro_Line_1_Schedule"

##### 1. 테이블 속성의 타입을 알아보자.

In [2]:
# Context Manager 사용 (권장)
with sqlite3.connect(DB_PATH) as conn:
    query = f"""
            SELECT *
            FROM {TABLE}
            """
    result = pd.read_sql(query, conn)
display(result.dtypes.to_frame(name='dtype'))

         dtype
고유번호     int64
호선       int64
역사코드     int64
역사명     object
주중주말    object
방향      object
급행여부     int64
열차코드    object
열차도착시간  object
열차출발시간  object
출발역     object
도착역     object

##### 2. 전체 데이터를 확인해보자.

In [3]:
# Context Manager 사용 (권장)
with sqlite3.connect(DB_PATH) as conn:
    query = f"""
            SELECT *
            FROM {TABLE}
            """
    result = pd.read_sql(query, conn)
result

,고유번호,호선,역사코드,역사명,주중주말,방향,급행여부,열차코드,열차도착시간,열차출발시간,출발역,도착역
0,1,1,150,서울역,DAY,DOWN,0,K101,12:53:00,12:53:30,양주,인천
1,2,1,150,서울역,DAY,DOWN,0,K103,13:02:30,13:03:00,소요산,인천
2,3,1,150,서울역,DAY,DOWN,0,K107,13:25:00,13:25:30,의정부,인천
3,4,1,150,서울역,DAY,DOWN,0,K11,5:30:00,5:30:30,광운대,인천
4,5,1,150,서울역,DAY,DOWN,0,K111,13:48:00,13:48:30,의정부,인천
...,...,...,...,...,...,...,...,...,...,...,...,...
88426,88427,1,1919,연천,SAT,UP,0,K816,22:26:30,None,구로,연천
88427,88428,1,1919,연천,SAT,UP,0,K952,6:14:00,None,광운대,연천
88428,88429,1,1919,연천,SAT,UP,0,K966,15:26:00,None,광운대,연천
88429,88430,1,1919,연천,SAT,UP,0,K970,19:19:00,None,광운대,연천
88430,88431,1,1919,연천,SAT,UP,0,K972,20:17:00,None,광운대,연천

##### 3. 전체 역의 수를 알아보자.

In [4]:
# Context Manager 사용 (권장)
with sqlite3.connect(DB_PATH) as conn:
    query = f"""
            SELECT
                COUNT(DISTINCT `역사코드`) as 역의수
            FROM {TABLE}
            """
    result = pd.read_sql(query, conn)
result

   역의수
0  102

##### 4. 출발역 목록을 알아보자.

In [5]:
# Context Manager 사용 (권장)
with sqlite3.connect(DB_PATH) as conn:
    query = f"""
            SELECT
                DISTINCT `출발역` as 기점
            FROM {TABLE}
            """
    result = pd.read_sql(query, conn)
result

     기점
0    양주
1   소요산
2   의정부
3   광운대
4    연천
5    창동
6   동두천
7   청량리
8   동묘앞
9   서울역
10   인천
11   부평
12   병점
13  서동탄
14   천안
15   신창
16   구로
17   용산
18   부천
19  동인천
20  영등포
21   광명

##### 5. 도착역 목록을 알아보자.

In [6]:
# Context Manager 사용 (권장)
with sqlite3.connect(DB_PATH) as conn:
    query = f"""
            SELECT
                DISTINCT `도착역` as 종점
            FROM {TABLE}
            """
    result = pd.read_sql(query, conn)
result

     종점
0    인천
1   서동탄
2    병점
3    부평
4    신창
5    천안
6    구로
7   서울역
8   동두천
9   광운대
10  소요산
11   양주
12  의정부
13   연천
14  청량리
15  동묘앞
16  동인천
17   용산
18   광명
19  영등포
20   부천

##### 6. 운행구간을 알아보자.

In [ ]:
# Context Manager 사용 (권장)
with sqlite3.connect(DB_PATH) as conn:
    query = f"""
            SELECT
                `출발역` AS 기점,
                `도착역` AS 종점
            FROM {TABLE}
            GROUP BY `출발역`, `도착역`
            """
    result = pd.read_sql(query, conn)
result

      기점   종점
0     광명  영등포
1    광운대   구로
2    광운대  동두천
3    광운대   병점
4    광운대  서동탄
..   ...  ...
97   청량리   병점
98   청량리  서동탄
99   청량리  서울역
100  청량리   신창
101  청량리   천안

[102 rows x 2 columns]

##### 7. DAY / SAT / END별 열차 운행 수

In [ ]:
# Context Manager 사용 (권장)
with sqlite3.connect(DB_PATH) as conn:
    query = f"""
            SELECT
                `주중주말`,
                COUNT(*) AS 운행수
            FROM {TABLE}
            GROUP BY `주중주말`
            """
    result = pd.read_sql(query, conn)
result

  주중주말    운행수
0  DAY  31303
1  END  28564
2  SAT  28564